Revit 2027 API
BuiltInFailures.RoomFailures.RoomsCreatedAutomatically Property
 [Room] [Room] created automatically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomsCreatedAutomatically { get; }
Public Shared ReadOnly Property RoomsCreatedAutomatically As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomsCreatedAutomatically {
	FailureDefinitionId^ get ();
}
static member RoomsCreatedAutomatically : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace